src/Documents/ПлатежноеПоручениеИсходящее/ПлатежноеПоручениеИсходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлатежноеПоручениеИсходящее</name>
  <basedOn>Document.ГТД</basedOn>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>ГТД</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКвитанции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПоступлениеУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Пост</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКомиссии</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ПлатежноеПоручениеИсходящее/Forms/Документ/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		ОбщийДокументы.НачальноеЗаполнение ( Объект );
		// Объект.Счет = Объект.Организация.ОсновнойСчет;
	Иначе
		// код ...	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПлатежаПриИзменении ( Элемент )
	
	рассчитатьСумму ();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаКомиссииПриИзменении ( Элемент )
	
	рассчитатьСумму ();
	
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСумму ()
	
	Объект.Сумма = Объект.СуммаПлатежа + Объект.СуммаКомиссии;  
	
КонецПроцедуры 

&НаКлиенте
Процедура КонтрагентПриИзменении ( Элемент )
	
	Объект.Пост = ПолучитьГоловногоКонтрагента ( Объект.Контрагент );
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьГоловногоКонтрагента ( Контрагент )
	
	пост = Справочники.Контрагенты.ПустаяСсылка ();
	Если ( ЗначениеЗаполнено ( Контрагент ) ) Тогда
		пост = Контрагент.ГоловнойКонтрагент;
	КонецЕсли; 
	Возврат пост;

КонецФункции
